<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>《Effective Java》- 类和接口 - LoveDev</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="一个踏踏实实的程序员">





    <meta name="description" content="&amp;#x4F7F;&amp;#x7C7B;&amp;#x6210;&amp;#x5458;&amp;#x7684;&amp;#x53EF;&amp;#x8BBF;&amp;#x95EE;&amp;#x6027;&amp;#x6700;&amp;#x5C0F;&amp;#x5316;">
<meta property="og:type" content="article">
<meta property="og:title" content="《Effective Java》- 类和接口">
<meta property="og:url" content="http://yoursite.com/2018/08/21/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Effective%20Java/%E3%80%8AEffective-java%E3%80%8B-%E7%B1%BB%E5%92%8C%E6%8E%A5%E5%8F%A3/index.html">
<meta property="og:site_name" content="LoveDev">
<meta property="og:description" content="&amp;#x4F7F;&amp;#x7C7B;&amp;#x6210;&amp;#x5458;&amp;#x7684;&amp;#x53EF;&amp;#x8BBF;&amp;#x95EE;&amp;#x6027;&amp;#x6700;&amp;#x5C0F;&amp;#x5316;">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2018-08-21T06:57:58.000Z">
<meta property="article:modified_time" content="2020-03-07T06:01:36.514Z">
<meta property="article:author" content="Kevin">
<meta property="article:tag" content="Java">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-159956718-1"></script>
<script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-159956718-1');
</script>


    


<meta name="generator" content="Hexo 4.2.1"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    <img src="/favicon.png" alt="" height="28">
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">archives</a>
            
            <a class="navbar-item "
               href="/tags">tags</a>
            
            <a class="navbar-item "
               href="/about">about</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#使类成员的可访问性最小化">1&nbsp;&nbsp;<b>使类成员的可访问性最小化</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#在公有类中使用访问方法而非公有域">2&nbsp;&nbsp;<b>在公有类中使用访问方法而非公有域</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#使可变性最小化">3&nbsp;&nbsp;<b>使可变性最小化</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#复合优于继承">4&nbsp;&nbsp;<b>复合优于继承</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#要么为继承而设计，并提供文档说明，要么就禁止继承">5&nbsp;&nbsp;<b>要么为继承而设计，并提供文档说明，要么就禁止继承</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#接口优于抽象类">6&nbsp;&nbsp;<b>接口优于抽象类</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#接口只用于定义类型">7&nbsp;&nbsp;<b>接口只用于定义类型</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#类层次优于标签类">8&nbsp;&nbsp;<b>类层次优于标签类</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#用函数对象表示策略">9&nbsp;&nbsp;<b>用函数对象表示策略</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#优先考虑静态成员类">10&nbsp;&nbsp;<b>优先考虑静态成员类</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/KevinLoveGitHub" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article style="padding-top: 1.5rem!important;" class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            《Effective Java》- 类和接口
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-08-21T06:57:58.000Z" itemprop="datePublished">8月 21 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            23 分钟 读完 (约 3427 字)
        </span>
        
    </div>

    
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><h1 id="&#x4F7F;&#x7C7B;&#x6210;&#x5458;&#x7684;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x6700;&#x5C0F;&#x5316;"><a href="#&#x4F7F;&#x7C7B;&#x6210;&#x5458;&#x7684;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x6700;&#x5C0F;&#x5316;" class="headerlink" title="&#x4F7F;&#x7C7B;&#x6210;&#x5458;&#x7684;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x6700;&#x5C0F;&#x5316;"></a>&#x4F7F;&#x7C7B;&#x6210;&#x5458;&#x7684;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x6700;&#x5C0F;&#x5316;</h1><a id="more"></a>
<p>&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x4ECE;&#x8BE5;&#x6A21;&#x5757;&#x5BF9;&#x4E8E;&#x5916;&#x90E8;&#x6A21;&#x5757;&#x662F;&#x5426;&#x9690;&#x85CF;&#x4E86;&#x5185;&#x90E8;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x6765;&#x533A;&#x522B;&#x597D;&#x574F;&#xFF0C;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x9690;&#x85CF;&#x5185;&#x90E8;&#x7EC6;&#x8282;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x8FC7; API &#x6765;&#x4E92;&#x76F8;&#x901A;&#x4FE1;&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x53EB;&#x505A;<strong>&#x4FE1;&#x606F;&#x9690;&#x85CF;</strong>&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;<strong>&#x9AD8;&#x5185;&#x805A;&#xFF0C;&#x4F4E;&#x8026;&#x5408;</strong>&#x7684;&#x57FA;&#x7840;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x6709;&#x4E00;&#x4E0B;&#x51E0;&#x70B9;&#x597D;&#x5904;&#xFF1A;</p>
<!--more-->
<ul>
<li>&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F18;&#x5316;&#xFF0C;&#x4F7F;&#x7528;</li>
<li>&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5185;&#x90E8;&#x7EC6;&#x8282;&#x662F;&#x9690;&#x85CF;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x4F7F;&#x7528;&#x4E86;&#x8BE5;&#x6A21;&#x5757;&#x7684;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#xFF0C;&#x4E5F;&#x4E0D;&#x7528;&#x5173;&#x5FC3;&#x8BE5;&#x6A21;&#x5757;&#x662F;&#x5426;&#x4FEE;&#x6539;&#x8FC7;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;</li>
<li>&#x7531;&#x4E8E;&#x6A21;&#x5757;&#x8DB3;&#x591F;&#x72EC;&#x7ACB;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#xFF0C;&#x6240;&#x6709;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x6A21;&#x5757;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x628A;&#x8BE5;&#x6A21;&#x5757;&#x653E;&#x5230;&#x5176;&#x4ED6;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x4F9D;&#x65E7;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x4F7F;&#x7528;</li>
</ul>
<p>&#x4E00;&#x4E2A;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x539F;&#x5219;&#xFF1A;<strong>&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4F7F;&#x6BCF;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x6210;&#x5458;&#x4E0D;&#x88AB;&#x5916;&#x754C;&#x8BBF;&#x95EE;</strong></p>
<ul>
<li>&#x5982;&#x679C;&#x7C7B;&#x6216;&#x8005;&#x63A5;&#x53E3;&#x80FD;&#x505A;&#x6210;&#x5305;&#x7EA7;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x505A;&#x6210;&#x5305;&#x7EA7;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5B83;&#x5B9E;&#x9645;&#x662F;&#x5305;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BE5;&#x5305;&#x5BFC;&#x51FA; API&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x540E;&#x5BF9;&#x8BE5;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x589E;&#x5220;&#x6539;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x8C03;&#x7528;&#x8005;&#x3002;&#x5982;&#x679C;&#x505A;&#x6210;&#x516C;&#x6709;&#x7684;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x5C31;&#x6709;&#x8D23;&#x4EFB;&#x4E00;&#x76F4;&#x7EF4;&#x62A4;&#x5B83;&#xFF0C;&#x4FDD;&#x6301;&#x5B83;&#x7684;&#x517C;&#x5BB9;&#x6027;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x63A5;&#x53E3;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x88AB;&#x7528;&#x5230;&#xFF0C;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x628A;&#x5B83;&#x505A;&#x6210;&#x90A3;&#x4E2A;&#x7C7B;&#x7684;&#x79C1;&#x7528;&#x5185;&#x90E8;&#x7C7B;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x8BE5;&#x7C7B;&#x7684;&#x8BBF;&#x95EE;&#x8303;&#x56F4;&#x9650;&#x5236;&#x5230;&#x4E86;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x90A3;&#x4E2A;&#x7C7B;&#x4E2D;</li>
<li>Java &#x4E2D;&#x7684;&#x7EE7;&#x627F;&#x548C;&#x5B9E;&#x73B0;&#x9650;&#x5236;&#x4E86;&#x964D;&#x4F4E;&#x51FD;&#x6570;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x63A5;&#x53E3;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x516C;&#x6709;&#x7684;&#xFF0C;&#x800C;&#x7EE7;&#x627F;&#x4E86;&#x8D85;&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#x5728;&#x8986;&#x76D6;&#x8D85;&#x7C7B;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x8BBF;&#x95EE;&#x7EA7;&#x522B;&#x5FC5;&#x987B;&#x8981;&#x9AD8;&#x4E8E;&#x8D85;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8981;&#x4FDD;&#x8BC1;&#x5728;&#x4F7F;&#x7528;&#x8D85;&#x7C7B;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x80FD;&#x7528;&#x5B50;&#x7C7B;</li>
<li>&#x53EF;&#x53D8;&#x7684;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x53D8;&#x91CF;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x662F;&#x516C;&#x6709;&#x7684;</li>
<li>&#x7531;&#x4E8E;&#x957F;&#x5EA6;&#x975E;&#x96F6;&#x7684;&#x6570;&#x7EC4;&#x603B;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7C7B;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x516C;&#x6709;&#x9759;&#x6001;&#x7684;&#x6570;&#x7EC4;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x63D0;&#x4F9B;&#x8FD4;&#x56DE;&#x8FD9;&#x7C7B;&#x6570;&#x7EC4;&#x7684;&#x51FD;&#x6570;</li>
<li>&#x7C7B;&#x4E2D;&#x80FD;&#x591F;&#x5BF9;&#x5916;&#x90E8;&#x66B4;&#x9732;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x53EA;&#x6709;&#x9759;&#x6001; final &#x5E38;&#x91CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E38;&#x91CF;&#x8981;&#x4E48;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7C7B;&#x578B;</li>
</ul>
<h1 id="&#x5728;&#x516C;&#x6709;&#x7C7B;&#x4E2D;&#x4F7F;&#x7528;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x800C;&#x975E;&#x516C;&#x6709;&#x57DF;"><a href="#&#x5728;&#x516C;&#x6709;&#x7C7B;&#x4E2D;&#x4F7F;&#x7528;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x800C;&#x975E;&#x516C;&#x6709;&#x57DF;" class="headerlink" title="&#x5728;&#x516C;&#x6709;&#x7C7B;&#x4E2D;&#x4F7F;&#x7528;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x800C;&#x975E;&#x516C;&#x6709;&#x57DF;"></a>&#x5728;&#x516C;&#x6709;&#x7C7B;&#x4E2D;&#x4F7F;&#x7528;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x800C;&#x975E;&#x516C;&#x6709;&#x57DF;</h1><p>&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4E3A; JavaBean &#x63D0;&#x4F9B;&#x7684; <code>get</code>&#x3001;<code>set</code> &#x51FD;&#x6570;&#x7EC4;&#x5408;</p>
<p>Q&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x628A;&#x7C7B;&#x7684;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;&#x516C;&#x6709;&#x7684;&#x5462;&#xFF1F;<br>A&#xFF1A;&#x9996;&#x5148;&#x4E3A;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x63D0;&#x4F9B;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4FDD;&#x7559;&#x4E86;&#x5C06;&#x6765;&#x6539;&#x53D8;&#x8BE5;&#x7C7B;&#x5185;&#x90E8;&#x8868;&#x793A;&#x6CD5;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5728;&#x5916;&#x90E8;&#x8C03;&#x7528;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x6539;&#x53D8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x5185;&#x90E8;&#x8868;&#x793A;&#x6CD5;&#x6765;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;</p>
<p>&#x5982;&#x679C;&#x662F;&#x5185;&#x90E8;&#x5D4C;&#x5957;&#x7C7B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x4E3A;&#x516C;&#x6709;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x90E8;&#x5D4C;&#x5957;&#x7C7B;&#x7684;&#x53D8;&#x5316;&#x8303;&#x56F4;&#x88AB;&#x9650;&#x5236;&#x5230;&#x4E86;&#x5916;&#x56F4;&#x7C7B;&#x4E2D;</p>
<h1 id="&#x4F7F;&#x53EF;&#x53D8;&#x6027;&#x6700;&#x5C0F;&#x5316;"><a href="#&#x4F7F;&#x53EF;&#x53D8;&#x6027;&#x6700;&#x5C0F;&#x5316;" class="headerlink" title="&#x4F7F;&#x53EF;&#x53D8;&#x6027;&#x6700;&#x5C0F;&#x5316;"></a>&#x4F7F;&#x53EF;&#x53D8;&#x6027;&#x6700;&#x5C0F;&#x5316;</h1><p>&#x4E3A;&#x4E86;&#x8BA9;&#x7C7B;&#x53D8;&#x6210;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x539F;&#x5219;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x4F1A;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x7684;&#x65B9;&#x6CD5;</li>
<li>&#x4FDD;&#x8BC1;&#x7C7B;&#x4E0D;&#x4F1A;&#x88AB;&#x6269;&#x5C55; - &#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5B50;&#x7C7B;&#x5316;&#xFF0C;&#x5E38;&#x89C1;&#x505A;&#x6CD5;&#x662F;&#x4F7F;&#x8FD9;&#x4E2A;&#x7C7B;&#x53D8;&#x6210; final&#xFF0C;&#x6216;&#x8005;&#x79C1;&#x6709;&#x5316;&#x6240;&#x6709;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x6DFB;&#x52A0;&#x516C;&#x6709;&#x7684;&#x9759;&#x6001;&#x5DE5;&#x5382;</li>
<li>&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x662F; final &#x7684;</li>
<li>&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x662F; private &#x7684;</li>
<li>&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x5F15;&#x7528;&#x4E86;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x4E92;&#x65A5;&#x8BBF;&#x95EE; - &#x9700;&#x8981;&#x786E;&#x4FDD;&#x4F7F;&#x7528;&#x8BE5;&#x7C7B;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x65E0;&#x6CD5;&#x4ECE;&#x8BE5;&#x7C7B;&#x4E2D;&#x83B7;&#x53D6;&#x5230;&#x8BE5;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x8FDB;&#x800C;&#x7834;&#x574F;&#x7C7B;&#x7684;&#x4E0D;&#x53EF;&#x53D8;&#x6027;&#xFF1B;&#x5E76;&#x4E14;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x4F9B;&#x7684;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x521D;&#x59CB;&#x8FD9;&#x6837;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x7684;&#x8BBF;&#x95EE;&#x51FD;&#x6570;&#xFF1B;&#x6784;&#x9020;&#x5668;&#x3001;&#x8BBF;&#x95EE;&#x51FD;&#x6570;&#x4EE5;&#x53CA; <code>readObject</code> &#x65B9;&#x6CD5;&#x4E2D;&#x4F7F;&#x7528; <strong>&#x4FDD;&#x62A4;&#x6027;&#x62F7;&#x8D1D;</strong> &#x6280;&#x672F;</li>
</ul>
<p>&#x7531;&#x4E8E;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5B83;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x81EA;&#x7531;&#x5206;&#x4EAB;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x503C;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x5185;&#x5B58;&#x5F88;&#x4F4E;&#x5219;&#x5F71;&#x54CD;&#x4E0D;&#x4F1A;&#x592A;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6709;&#x5927;&#x578B;&#x5BF9;&#x8C61;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#x707E;&#x96BE;&#x6027;&#x7684;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x679C;&#x80FD;&#x591F;&#x7CBE;&#x786E;&#x9884;&#x6D4B;&#x51FA;&#x5BA2;&#x6237;&#x7AEF;&#x60F3;&#x8981;&#x5728;&#x4E0D;&#x53EF;&#x53D8;&#x7C7B;&#x4E0A;&#x505A;&#x54EA;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x591A;&#x9636;&#x6BB5;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A; <strong>&#x5305;&#x7EA7;&#x79C1;&#x6709;&#x53EF;&#x53D8;&#x914D;&#x5957;&#x7C7B;</strong>&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A; <strong>&#x516C;&#x6709;&#x53EF;&#x53D8;&#x914D;&#x5957;&#x7C7B;</strong>&#xFF0C;&#x5C31;&#x5982;&#x540C; String &#x548C; StringBuilder &#x4EE5;&#x53CA;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#x4E0B;&#x7684; BigInteger &#x548C; BitSet</p>
<p>&#x5982;&#x679C;&#x7C7B;&#x5B9E;&#x5728;&#x4E0D;&#x80FD;&#x505A;&#x6210;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x5C31;&#x5C3D;&#x91CF;&#x9650;&#x5236;&#x5B83;&#x7684;&#x53EF;&#x53D8;&#x6027;&#xFF0C;&#x9664;&#x975E;&#x6709;&#x7279;&#x522B;&#x7684;&#x7406;&#x7531;&#x8981;&#x4F7F;&#x5C5E;&#x6027;&#x53D8;&#x6210;&#x975E; final&#xFF0C;&#x5426;&#x5219;&#x4E00;&#x5F8B;&#x90FD;&#x662F; final</p>
<p>&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x51FD;&#x6570;&#xFF0C;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x7F13;&#x5B58;&#x9891;&#x7E41;&#x88AB;&#x8BF7;&#x6C42;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8BF7;&#x6C42;&#x6EE1;&#x8DB3;&#x8BE5;&#x5B9E;&#x4F8B;&#xFF0C;&#x5219;&#x4E0D;&#x7528;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x5373;&#x53EF;&#xFF0C;&#x964D;&#x4F4E;&#x5185;&#x5B58;&#x5360;&#x7528;&#x548C;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x56DE;&#x6536;&#xFF0C;&#x5178;&#x578B;&#x4F8B;&#x5B50;&#x5C31;&#x662F; <code>Boolean#valueOf</code></p>
<h1 id="&#x590D;&#x5408;&#x4F18;&#x4E8E;&#x7EE7;&#x627F;"><a href="#&#x590D;&#x5408;&#x4F18;&#x4E8E;&#x7EE7;&#x627F;" class="headerlink" title="&#x590D;&#x5408;&#x4F18;&#x4E8E;&#x7EE7;&#x627F;"></a>&#x590D;&#x5408;&#x4F18;&#x4E8E;&#x7EE7;&#x627F;</h1><p>&#x9996;&#x5148;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x7EE7;&#x627F;&#x6253;&#x7834;&#x4E86;&#x5C01;&#x88C5;&#x6027;&#xFF1A;<br>&#x5982;&#x679C;&#x5B50;&#x7C7B;&#x4F9D;&#x8D56;&#x7236;&#x7C7B;&#x7684;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x7248;&#x672C;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7236;&#x7C7B;&#x7684;&#x8BE5;&#x529F;&#x80FD;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x5B50;&#x7C7B;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x906D;&#x5230;&#x7834;&#x574F;&#xFF0C;&#x65E2;&#x7136;&#x5B83;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53D8;&#x5316;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x5982;&#x679C;&#x7236;&#x7C7B;&#x5728;&#x67D0;&#x4E2A;&#x7248;&#x672C;&#x4E2D;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x548C;&#x5B50;&#x7C7B;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x7B7E;&#x540D;&#x76F8;&#x540C;&#x4F46;&#x662F;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x7A0B;&#x5E8F;&#x5C31;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x7F16;&#x8BD1;</p>
<p>&#x89E3;&#x51B3;&#x6B64;&#x7C7B;&#x95EE;&#x9898;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x6CD5; - <strong>&#x590D;&#x5408;</strong>&#xFF0C;&#x4E0D;&#x7528;&#x6269;&#x5C55;&#x73B0;&#x6709;&#x7684;&#x7C7B;&#xFF0C;&#x53EA;&#x7528;&#x5728;&#x65B0;&#x7684;&#x7C7B;&#x4E2D;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x5F15;&#x7528;&#x73B0;&#x6709;&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7C7B;&#x4E5F;&#x53EB;&#x505A;&#x5305;&#x88C5;&#x7C7B;&#x3002;&#x6B64;&#x65F6;&#x88AB;&#x5305;&#x88C5;&#x7684;&#x7C7B;&#x589E;&#x52A0;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5305;&#x88C5;&#x7C7B;&#xFF1B;&#x5305;&#x88C5;&#x7C7B;&#x4E5F;&#x9690;&#x85CF;&#x4E86;&#x88AB;&#x5305;&#x88C5;&#x7C7B;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x88AB;&#x5305;&#x88C5;&#x7C7B;&#x968F;&#x610F;&#x6269;&#x5C55;</p>
<h1 id="&#x8981;&#x4E48;&#x4E3A;&#x7EE7;&#x627F;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x7981;&#x6B62;&#x7EE7;&#x627F;"><a href="#&#x8981;&#x4E48;&#x4E3A;&#x7EE7;&#x627F;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x7981;&#x6B62;&#x7EE7;&#x627F;" class="headerlink" title="&#x8981;&#x4E48;&#x4E3A;&#x7EE7;&#x627F;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x7981;&#x6B62;&#x7EE7;&#x627F;"></a>&#x8981;&#x4E48;&#x4E3A;&#x7EE7;&#x627F;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x7981;&#x6B62;&#x7EE7;&#x627F;</h1><p>&#x5982;&#x679C;&#x60F3;&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x53EF;&#x88AB;&#x7EE7;&#x627F;&#x7684;&#x7C7B;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5B8C;&#x5584;&#x7684;&#x6587;&#x6863; - &#x5BF9;&#x4E8E;&#x516C;&#x6709;&#x7684;&#x6216;&#x8005;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x51FD;&#x6570;&#x6216;&#x8005;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x6587;&#x6863;&#x5FC5;&#x987B;&#x6307;&#x660E;&#x8BE5;&#x51FD;&#x6570;&#x6216;&#x8005;&#x6784;&#x9020;&#x5668;&#x8C03;&#x7528;&#x4E86;&#x90A3;&#x4E9B;&#x53EF;&#x8986;&#x76D6;&#x51FD;&#x6570;</li>
</ul>
<h1 id="&#x63A5;&#x53E3;&#x4F18;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;"><a href="#&#x63A5;&#x53E3;&#x4F18;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;" class="headerlink" title="&#x63A5;&#x53E3;&#x4F18;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;"></a>&#x63A5;&#x53E3;&#x4F18;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;</h1><p>&#x7531;&#x4E8E; Java &#x4E2D;&#x53EA;&#x5141;&#x8BB8;&#x5355;&#x7EE7;&#x627F;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x4F5C;&#x4E3A;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x5C31;&#x53D7;&#x5230;&#x4E86;&#x6781;&#x5927;&#x7684;&#x9650;&#x5236;&#x3002;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x7684;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li><p><strong>&#x73B0;&#x6709;&#x7684;&#x7C7B;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x66F4;&#x65B0;</strong> - &#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6709;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x63A5;&#x53E3;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x589E;&#x52A0;&#x51E0;&#x4E2A;&#x8BE5;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x5373;&#x53EF;&#x3002;&#x5982;&#x679C;&#x662F;&#x7EE7;&#x627F;&#x7684;&#x8BDD;&#xFF0C;&#x73B0;&#x6709;&#x7684;&#x7C7B;&#x5F88;&#x96BE;&#x6269;&#x5C55;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x6709;&#x4E24;&#x4E2A;&#x7C7B;&#x9700;&#x8981;&#x6269;&#x5C55;&#x540C;&#x4E00;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x628A;&#x8BE5;&#x62BD;&#x8C61;&#x7C7B;&#x653E;&#x5230;&#x7C7B;&#x5C42;&#x6B21;&#x7684;&#x9AD8;&#x5904;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x53C8;&#x95F4;&#x63A5;&#x7684;&#x4F24;&#x5BB3;&#x5230;&#x4E86;&#x7C7B;&#x5C42;&#x6B21;&#xFF0C;&#x8FEB;&#x4F7F;&#x6240;&#x6709;&#x5B50;&#x7C7B;&#x90FD;&#x8981;&#x6269;&#x5C55;&#x8FD9;&#x4E2A;&#x62BD;&#x8C61;&#x7C7B;</p>
</li>
<li><p><strong>&#x63A5;&#x53E3;&#x662F;&#x5B9A;&#x4E49; mixin&#xFF08;&#x6DF7;&#x5408;&#x7C7B;&#x578B;&#xFF09;&#x7684;&#x7406;&#x60F3;&#x9009;&#x62E9;</strong> - mixin &#x662F;&#x6307;&#xFF1A;&#x7C7B;&#x9664;&#x4E86;&#x5B9E;&#x73B0;&#x5B83;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A; mixin &#x7C7B;&#x578B;&#xFF0C;&#x8868;&#x660E;&#x8BE5;&#x7C7B;&#x5177;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4F8B;&#x5982; <code>comparable</code> &#x5C31;&#x662F;&#x4E00;&#x4E2A; mixin &#x63A5;&#x53E3;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x7C7B;&#x8868;&#x660E;&#x5B83;&#x7684;&#x5B9E;&#x4F8B;&#x53EF;&#x4EE5;&#x4E0E;&#x5176;&#x4ED6;&#x53EF;&#x5BF9;&#x6BD4;&#x7684;&#x7C7B;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x6392;&#x5E8F;&#xFF0C;&#x7531;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;&#x4E0D;&#x80FD;&#x88AB;&#x66F4;&#x65B0;&#x5230;&#x73B0;&#x6709;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x62BD;&#x8C61;&#x7C7B;&#x4E0D;&#x7528;&#x7531;&#x4E8E;&#x5B9A;&#x4E49; minin</p>
</li>
<li><p><strong>&#x63A5;&#x53E3;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x975E;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x7C7B;&#x578B;&#x6846;&#x67B6;</strong> </p>
<p>  </p><figure class="highlight java hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">Singer</span></span>{</span><br><span class="line">    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sing</span><span class="hljs-params">()</span></span>;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">Songwriter</span></span>{</span><br><span class="line">    <span class="hljs-function">Song <span class="hljs-title">compose</span><span class="hljs-params">()</span></span>;</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>  &#x5BF9;&#x4E00;&#x4E2A;&#x65E2;&#x662F;&#x6B4C;&#x5531;&#x5BB6;&#x53C8;&#x662F;&#x4F5C;&#x66F2;&#x5BB6;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8BA9;&#x8BE5;&#x5BF9;&#x8C61;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x8FD9;&#x4E24;&#x4E2A;&#x63A5;&#x53E3;&#x5373;&#x53EF;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x518D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF1A;</p>
<p>  </p><figure class="highlight java hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">SingerSongwriter</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Singer</span>&#xFF0C; <span class="hljs-title">Songwriter</span></span>{</span><br><span class="line">    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sing</span><span class="hljs-params">()</span></span>;</span><br><span class="line">    <span class="hljs-function">Song <span class="hljs-title">compose</span><span class="hljs-params">()</span></span>;</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><br>  &#x5982;&#x679C;&#x662F;&#x7EE7;&#x627F;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x4E0D;&#x592A;&#x597D;&#x5904;&#x7406;<p></p>
</li>
</ul>
<p>&#x63A5;&#x53E3;&#x53EA;&#x80FD;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;&#x63A5;&#x53E3;&#x4F5C;&#x4E3A;<strong>&#x5B9A;&#x4E49;&#x7C7B;&#x578B;</strong>&#x5E76;&#x63D0;&#x4F9B;&#x5B9E;&#x73B0;&#x4E0A;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;<strong>&#x901A;&#x8FC7;&#x5BF9;&#x5BFC;&#x51FA;&#x7684;&#x6BCF;&#x4E2A;&#x91CD;&#x8981;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7684;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#xFF0C;&#x628A;&#x63A5;&#x53E3;&#x548C;&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x4F18;&#x70B9;&#x7ED3;&#x5408;&#x8D77;&#x6765;</strong>&#xFF0C;&#x63A5;&#x53E3;&#x8FD8;&#x662F;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#xFF0C;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#x63A5;&#x7BA1;&#x4E86;&#x6240;&#x6709;&#x4E0E;&#x63A5;&#x53E3;&#x5B9E;&#x73B0;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;</p>
<p>&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#x90FD;&#x88AB;&#x79F0;&#x4E3A; <code>AbstractInterface</code>&#xFF0C;&#x5176;&#x4E2D; Interface &#x662F;&#x6307;&#x63A5;&#x53E3;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x4F8B;&#x5982; <code>AbstractSet</code>&#x3001;<code>AbstractList</code> &#x7B49;</p>
<p>&#x4F7F;&#x7528;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x662F;&#xFF1A;<strong>&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x6F14;&#x53D8;&#x6BD4;&#x63A5;&#x53E3;&#x7684;&#x6F14;&#x53D8;&#x8981;&#x5BB9;&#x6613;&#x7684;&#x591A;</strong>&#xFF0C;&#x5982;&#x679C;&#x540E;&#x671F;&#x5728;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x59CB;&#x7EC8;&#x53EF;&#x4EE5;&#x6709;&#x9ED8;&#x8BA4;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x7528;&#x5B50;&#x7C7B;&#x505A;&#x4EFB;&#x4F55;&#x6539;&#x53D8;&#x3002;&#x5982;&#x679C;&#x662F;&#x63A5;&#x53E3;&#xFF0C;&#x5219;&#x6240;&#x6709;&#x5B9E;&#x73B0;&#x8BE5;&#x63A5;&#x53E3;&#x7684;&#x5B50;&#x7C7B;&#x5C31;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x8BE5;&#x51FD;&#x6570;&#xFF0C;&#x6709;&#x4E86;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#x4E2D;&#x589E;&#x52A0;&#x8BE5;&#x51FD;&#x6570;&#x5373;&#x53EF;&#xFF0C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x51CF;&#x5C11;&#x4E86;&#x5BF9;&#x7ED3;&#x6784;&#x7684;&#x7834;&#x574F;</p>
<p>&#x5F53;&#x6F14;&#x53D8;&#x7684;&#x5BB9;&#x6613;&#x6027;&#x6BD4;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x529F;&#x80FD;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x7C7B;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x8FD9;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x3002;&#x5982;&#x679C;&#x5BFC;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x575A;&#x51B3;&#x8003;&#x8651;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;</p>
<h1 id="&#x63A5;&#x53E3;&#x53EA;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;"><a href="#&#x63A5;&#x53E3;&#x53EA;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;" class="headerlink" title="&#x63A5;&#x53E3;&#x53EA;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;"></a>&#x63A5;&#x53E3;&#x53EA;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;</h1><p>&#x6709;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4F1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x63A5;&#x53E3;&#x8FD9;&#x6837;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x662F;&#x5BF9;&#x63A5;&#x53E3;&#x7684;&#x4E0D;&#x826F;&#x4F7F;&#x7528;&#x3002;&#x5B9E;&#x73B0;&#x5E38;&#x91CF;&#x63A5;&#x53E3;&#xFF0C;&#x5BF9;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x8BF4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x4EE5;&#x540E;&#x7248;&#x672C;&#x8FED;&#x4EE3;&#x4E2D;&#x5982;&#x679C;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x5E38;&#x91CF;&#x65F6;&#xFF0C;&#x4F9D;&#x7136;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x517C;&#x5BB9;&#x6027;</p>
<p>&#x5982;&#x679C;&#x9700;&#x8981;&#x5BFC;&#x51FA;&#x5E38;&#x91CF;&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528; <strong>&#x679A;&#x4E3E;&#x7C7B;&#x578B;</strong> &#x6216;&#x8005;&#x4E0D;&#x53EF;&#x5B9E;&#x4F8B;&#x5316;&#x7684; <strong>&#x5DE5;&#x5177;&#x7C7B;</strong> &#x6765;&#x5BFC;&#x51FA;</p>
<h1 id="&#x7C7B;&#x5C42;&#x6B21;&#x4F18;&#x4E8E;&#x6807;&#x7B7E;&#x7C7B;"><a href="#&#x7C7B;&#x5C42;&#x6B21;&#x4F18;&#x4E8E;&#x6807;&#x7B7E;&#x7C7B;" class="headerlink" title="&#x7C7B;&#x5C42;&#x6B21;&#x4F18;&#x4E8E;&#x6807;&#x7B7E;&#x7C7B;"></a>&#x7C7B;&#x5C42;&#x6B21;&#x4F18;&#x4E8E;&#x6807;&#x7B7E;&#x7C7B;</h1><p></p><figure class="highlight java hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Figure</span> </span>{</span><br><span class="line">    <span class="hljs-keyword">enum</span> Shape { RECTANGLE, CIRCLE };</span><br><span class="line"></span><br><span class="line">    <span class="hljs-comment">// Tag field - the shape of this figure</span></span><br><span class="line">    <span class="hljs-keyword">final</span> Shape shape;</span><br><span class="line"></span><br><span class="line">    <span class="hljs-comment">// These fields are used only if shape is RECTANGLE</span></span><br><span class="line">    <span class="hljs-keyword">double</span> length;</span><br><span class="line">    <span class="hljs-keyword">double</span> width;</span><br><span class="line"></span><br><span class="line">    <span class="hljs-comment">// This field is used only if shape is CIRCLE</span></span><br><span class="line">    <span class="hljs-keyword">double</span> radius;</span><br><span class="line"></span><br><span class="line">    <span class="hljs-comment">// Constructor for circle</span></span><br><span class="line">    Figure(<span class="hljs-keyword">double</span> radius) {</span><br><span class="line">        shape = Shape.CIRCLE;</span><br><span class="line">        <span class="hljs-keyword">this</span>.radius = radius;</span><br><span class="line">    }</span><br><span class="line"></span><br><span class="line">    <span class="hljs-comment">// Constructor for rectangle</span></span><br><span class="line">    Figure(<span class="hljs-keyword">double</span> length, <span class="hljs-keyword">double</span> width) {</span><br><span class="line">        shape = Shape.RECTANGLE;</span><br><span class="line">        <span class="hljs-keyword">this</span>.length = length;</span><br><span class="line">        <span class="hljs-keyword">this</span>.width = width;</span><br><span class="line">    }</span><br><span class="line"></span><br><span class="line">    <span class="hljs-function"><span class="hljs-keyword">double</span> <span class="hljs-title">area</span><span class="hljs-params">()</span> </span>{</span><br><span class="line">        <span class="hljs-keyword">switch</span>(shape) {</span><br><span class="line">          <span class="hljs-keyword">case</span> RECTANGLE:</span><br><span class="line">            <span class="hljs-keyword">return</span> length * width;</span><br><span class="line">          <span class="hljs-keyword">case</span> CIRCLE:</span><br><span class="line">            <span class="hljs-keyword">return</span> Math.PI * (radius * radius);</span><br><span class="line">          <span class="hljs-keyword">default</span>:</span><br><span class="line">            <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> AssertionError(shape);</span><br><span class="line">        }</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x7C7B;&#xFF0C;&#x5373;&#x8868;&#x793A;&#x5706;&#x5F62;&#x4E5F;&#x8868;&#x793A;&#x77E9;&#x5F62;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x53E6;&#x5916;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x4FEE;&#x6539;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x591A;&#x79CD;&#x5F62;&#x72B6;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#xFF0C;&#x6781;&#x5927;&#x7834;&#x574F;&#x4E86;&#x53EF;&#x8BFB;&#x6027;&#xFF1B;&#x5B9E;&#x4F8B;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x4E5F;&#x968F;&#x4E4B;&#x63D0;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x627F;&#x62C5;&#x7740;&#x5C5E;&#x4E8E;&#x5176;&#x4ED6;&#x5F62;&#x72B6;&#x7684;&#x5C5E;&#x6027;&#x5B57;&#x6BB5;&#xFF1B;&#x800C;&#x4E14;&#x5B9E;&#x4F8B;&#x672C;&#x8EAB;&#x4E5F;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x7684;&#x5173;&#x4E8E;&#x5F62;&#x72B6;&#x7684;&#x7EBF;&#x7D22;&#xFF1B;<strong>&#x6807;&#x7B7E;&#x7C7B;&#x8FC7;&#x4E8E;&#x5197;&#x957F;&#xFF0C;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x6548;&#x7387;&#x4F4E;&#x4E0B;</strong></p>
<p>&#x5C06;&#x6807;&#x7B7E;&#x7C7B;&#x8F6C;&#x5316;&#x4E3A;&#x7C7B;&#x5C42;&#x6B21;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x4E3A;&#x6BCF;&#x79CD;&#x6807;&#x7B7E;&#x7C7B;&#x5B9A;&#x4E49;&#x5177;&#x4F53;&#x5B50;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x5B50;&#x7C7B;&#x4E2D;&#x53EA;&#x5305;&#x542B;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF1A;</p>
<p></p><figure class="highlight java hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">abstract</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Figure</span> </span>{</span><br><span class="line">    <span class="hljs-function"><span class="hljs-keyword">abstract</span> <span class="hljs-keyword">double</span> <span class="hljs-title">area</span><span class="hljs-params">()</span></span>;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Circle</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Figure</span> </span>{</span><br><span class="line">    <span class="hljs-keyword">final</span> <span class="hljs-keyword">double</span> radius;</span><br><span class="line"></span><br><span class="line">    Circle(<span class="hljs-keyword">double</span> radius) { <span class="hljs-keyword">this</span>.radius = radius; }</span><br><span class="line"></span><br><span class="line">    <span class="hljs-meta">@Override</span> <span class="hljs-function"><span class="hljs-keyword">double</span> <span class="hljs-title">area</span><span class="hljs-params">()</span> </span>{ <span class="hljs-keyword">return</span> Math.PI * (radius * radius); }</span><br><span class="line">}</span><br><span class="line"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Figure</span> </span>{</span><br><span class="line">    <span class="hljs-keyword">final</span> <span class="hljs-keyword">double</span> length;</span><br><span class="line">    <span class="hljs-keyword">final</span> <span class="hljs-keyword">double</span> width;</span><br><span class="line"></span><br><span class="line">    Rectangle(<span class="hljs-keyword">double</span> length, <span class="hljs-keyword">double</span> width) {</span><br><span class="line">        <span class="hljs-keyword">this</span>.length = length;</span><br><span class="line">        <span class="hljs-keyword">this</span>.width  = width;</span><br><span class="line">    }</span><br><span class="line">    <span class="hljs-meta">@Override</span> <span class="hljs-function"><span class="hljs-keyword">double</span> <span class="hljs-title">area</span><span class="hljs-params">()</span> </span>{ <span class="hljs-keyword">return</span> length * width; }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><br>&#x8FD9;&#x6837;&#x505A;&#x6709;&#x51E0;&#x4E2A;&#x597D;&#x5904;&#xFF1A;<p></p>
<ul>
<li>&#x5177;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x6E05;&#x6670;</li>
<li>&#x6BCF;&#x4E2A;&#x5B50;&#x7C7B;&#x4E0D;&#x53D7;&#x5230;&#x5176;&#x4ED6;&#x4E0D;&#x76F8;&#x5173;&#x6570;&#x636E;&#x7684;&#x62D6;&#x7D2F;</li>
<li>&#x6240;&#x6709;&#x5C5E;&#x6027;&#x90FD;&#x53EF;&#x4EE5;&#x662F; final</li>
<li>&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x90FD;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5177;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x6307;&#x660E;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#xFF0C;&#x9650;&#x5236;&#x53D8;&#x91CF;</li>
<li>&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x53CD;&#x6620;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x672C;&#x8D28;&#x4E0A;&#x7684;&#x5C42;&#x6B21;&#x5173;&#x7CFB;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x589E;&#x5F3A;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x66F4;&#x597D;&#x7684;&#x7F16;&#x8BD1;&#x65F6;&#x7C7B;&#x578B;&#x68C0;&#x6D4B;</li>
</ul>
<p></p><figure class="highlight java hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{</span><br><span class="line">    Square(<span class="hljs-keyword">double</span> side) {</span><br><span class="line">        <span class="hljs-keyword">super</span>(side, side);</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x53CD;&#x6620;&#x51FA;&#x6765;&#x6B63;&#x65B9;&#x5F62;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x77E9;&#x5F62;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x4F7F;&#x7528;&#x6807;&#x7B7E;&#x7C7B;&#xFF0C;&#x7528;&#x7C7B;&#x5C42;&#x6B21;&#x4EE3;&#x66FF;</p>
<h1 id="&#x7528;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x7B56;&#x7565;"><a href="#&#x7528;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x7B56;&#x7565;" class="headerlink" title="&#x7528;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x7B56;&#x7565;"></a>&#x7528;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x7B56;&#x7565;</h1><p>&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x8868;&#x793A;&#x8BE5;&#x7B56;&#x7565;&#xFF0C;&#x5177;&#x4F53;&#x7B56;&#x7565;&#x5B9E;&#x73B0;&#x8BE5;&#x63A5;&#x53E3;&#xFF0C;&#x5982;&#x4F55;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7B56;&#x7565;&#x53EA;&#x88AB;&#x4F7F;&#x7528;&#x4E00;&#x6B21;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x533F;&#x540D;&#x7C7B;&#x6765;&#x5B9E;&#x4F8B;&#x5316;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x591A;&#x6B21;&#x590D;&#x7528;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x88AB;&#x5B9E;&#x73B0;&#x4E3A;&#x79C1;&#x6709;&#x7684;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x516C;&#x6709;&#x7684;&#x9759;&#x6001; final &#x5C5E;&#x6027;&#x5BFC;&#x51FA;&#xFF0C;&#x5BFC;&#x51FA;&#x7C7B;&#x578B;&#x4E3A;&#x7B56;&#x7565;&#x63A5;&#x53E3;</p>
<h1 id="&#x4F18;&#x5148;&#x8003;&#x8651;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;"><a href="#&#x4F18;&#x5148;&#x8003;&#x8651;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;" class="headerlink" title="&#x4F18;&#x5148;&#x8003;&#x8651;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;"></a>&#x4F18;&#x5148;&#x8003;&#x8651;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;</h1><ul>
<li>&#x975E;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#x9ED8;&#x8BA4;&#x6301;&#x6709;&#x5916;&#x90E8;&#x7C7B;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#x751F;&#x547D;&#x5468;&#x671F;&#x6BD4;&#x5916;&#x90E8;&#x7C7B;&#x957F;&#xFF0C;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;</li>
<li>&#x5D4C;&#x5957;&#x7C7B;&#x9700;&#x8981;&#x72EC;&#x7ACB;&#x4E8E;&#x5916;&#x90E8;&#x7C7B;&#x5B58;&#x5728;&#xFF0C;&#x5FC5;&#x987B;&#x662F;&#x9759;&#x6001;&#x5185;&#x90E8;&#x7C7B;</li>
<li>&#x5982;&#x679C;&#x5D4C;&#x5957;&#x7C7B;&#x4E0D;&#x8BBF;&#x95EE;&#x5916;&#x90E8;&#x7C7B;&#x5B9E;&#x4F8B;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x5B83;&#x53D8;&#x6210;&#x9759;&#x6001;&#x5185;&#x90E8;&#x7C7B;&#xFF0C;&#x5426;&#x5219;&#x6BCF;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x7C7B;&#x5B9E;&#x4F8B;&#x90FD;&#x6301;&#x6709;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x7C7B;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x7A7A;&#x95F4;</li>
</ul>
</body></html>
    
    </div>
    

    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Java/">#Java</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2018/08/21/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Effective%20Java/%E3%80%8AEffective-java%E3%80%8B-%E6%B3%9B%E5%9E%8B/">《Effective Java》- 泛型</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2018/08/21/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Effective%20Java/%E3%80%8AEffective-java%E3%80%8B-%E5%AF%B9%E4%BA%8E%E6%89%80%E6%9C%89%E5%AF%B9%E8%B1%A1%E9%83%BD%E9%80%9A%E7%94%A8%E7%9A%84%E6%96%B9%E6%B3%95/">《Effective Java》- 对于所有对象都通用的方法</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='https://platform-api.sharethis.com/js/sharethis.js#property=5e62ac01d0c39800126ea9e5&amp;product=inline-share-buttons&amp;cms=sop' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/2018/08/21/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Effective%20Java/%E3%80%8AEffective-java%E3%80%8B-%E7%B1%BB%E5%92%8C%E6%8E%A5%E5%8F%A3/';
        this.page.identifier = '2018/08/21/读书笔记/Effective Java/《Effective-java》-类和接口/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'lovedev-org-1' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>


    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Kevin&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/KevinLoveGitHub" target="_blank" rel="noopener">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>